{"class_name": "Sequential", "config": {"name": "sequential_8", "layers": [{"class_name": "BatchNormalization", "config": {"name": "batch_normalization_907", "trainable": true, "batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Model", "config": {"name": "inception_resnet_v2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 1], "dtype": "float32", "sparse": false, "name": "input_9"}, "name": "input_9", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d_688", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_688", "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_704", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_704", "inbound_nodes": [[["conv2d_688", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_688", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_688", "inbound_nodes": [[["batch_normalization_704", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_689", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_689", "inbound_nodes": [[["activation_688", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_705", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_705", "inbound_nodes": [[["conv2d_689", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_689", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_689", "inbound_nodes": [[["batch_normalization_705", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_690", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_690", "inbound_nodes": [[["activation_689", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_706", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_706", "inbound_nodes": [[["conv2d_690", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_690", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_690", "inbound_nodes": [[["batch_normalization_706", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_20", "inbound_nodes": [[["activation_690", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_691", "trainable": true, "dtype": "float32", "filters": 80, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_691", "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_707", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_707", "inbound_nodes": [[["conv2d_691", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_691", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_691", "inbound_nodes": [[["batch_normalization_707", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_692", "trainable": true, "dtype": "float32", "filters": 192, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_692", "inbound_nodes": [[["activation_691", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_708", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_708", "inbound_nodes": [[["conv2d_692", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_692", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_692", "inbound_nodes": [[["batch_normalization_708", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_21", "inbound_nodes": [[["activation_692", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_696", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_696", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_712", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_712", "inbound_nodes": [[["conv2d_696", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_696", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_696", "inbound_nodes": [[["batch_normalization_712", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_694", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_694", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_697", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_697", "inbound_nodes": [[["activation_696", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_710", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_710", "inbound_nodes": [[["conv2d_694", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_713", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_713", "inbound_nodes": [[["conv2d_697", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_694", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_694", "inbound_nodes": [[["batch_normalization_710", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_697", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_697", "inbound_nodes": [[["batch_normalization_713", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d_29", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_29", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_693", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_693", "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_695", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_695", "inbound_nodes": [[["activation_694", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_698", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_698", "inbound_nodes": [[["activation_697", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_699", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_699", "inbound_nodes": [[["average_pooling2d_29", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_709", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_709", "inbound_nodes": [[["conv2d_693", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_711", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_711", "inbound_nodes": [[["conv2d_695", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_714", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_714", "inbound_nodes": [[["conv2d_698", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_715", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_715", "inbound_nodes": [[["conv2d_699", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_693", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_693", "inbound_nodes": [[["batch_normalization_709", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_695", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_695", "inbound_nodes": [[["batch_normalization_711", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_698", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_698", "inbound_nodes": [[["batch_normalization_714", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_699", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_699", "inbound_nodes": [[["batch_normalization_715", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "mixed_5b", "trainable": true, "dtype": "float32", "axis": 3}, "name": "mixed_5b", "inbound_nodes": [[["activation_693", 0, 0, {}], ["activation_695", 0, 0, {}], ["activation_698", 0, 0, {}], ["activation_699", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_703", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_703", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_719", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_719", "inbound_nodes": [[["conv2d_703", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_703", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_703", "inbound_nodes": [[["batch_normalization_719", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_701", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_701", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_704", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_704", "inbound_nodes": [[["activation_703", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_717", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_717", "inbound_nodes": [[["conv2d_701", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_720", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_720", "inbound_nodes": [[["conv2d_704", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_701", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_701", "inbound_nodes": [[["batch_normalization_717", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_704", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_704", "inbound_nodes": [[["batch_normalization_720", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_700", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_700", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_702", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_702", "inbound_nodes": [[["activation_701", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_705", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_705", "inbound_nodes": [[["activation_704", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_716", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_716", "inbound_nodes": [[["conv2d_700", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_718", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_718", "inbound_nodes": [[["conv2d_702", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_721", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_721", "inbound_nodes": [[["conv2d_705", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_700", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_700", "inbound_nodes": [[["batch_normalization_716", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_702", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_702", "inbound_nodes": [[["batch_normalization_718", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_705", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_705", "inbound_nodes": [[["batch_normalization_721", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "block35_1_mixed", "trainable": true, "dtype": "float32", "axis": 3}, "name": "block35_1_mixed", "inbound_nodes": [[["activation_700", 0, 0, {}], ["activation_702", 0, 0, {}], ["activation_705", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block35_1_conv", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block35_1_conv", "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "block35_1", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpkL2hvbWUvZmlsZnkvYW5hY29uZGEzL2Vu\ndnMvb3dnL2xpYi9weXRob24zLjcvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlvbnMvaW5j\nZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6oAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "keras_applications.inception_resnet_v2", "output_shape": [13, 13, 320], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "block35_1", "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block35_1_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block35_1_ac", "inbound_nodes": [[["block35_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_709", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_709", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_725", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_725", "inbound_nodes": [[["conv2d_709", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_709", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_709", "inbound_nodes": [[["batch_normalization_725", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_707", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_707", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_710", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_710", "inbound_nodes": [[["activation_709", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_723", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_723", "inbound_nodes": [[["conv2d_707", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_726", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_726", "inbound_nodes": [[["conv2d_710", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_707", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_707", "inbound_nodes": [[["batch_normalization_723", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_710", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_710", "inbound_nodes": [[["batch_normalization_726", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_706", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_706", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_708", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_708", "inbound_nodes": [[["activation_707", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_711", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_711", "inbound_nodes": [[["activation_710", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_722", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_722", "inbound_nodes": [[["conv2d_706", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_724", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_724", "inbound_nodes": [[["conv2d_708", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_727", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_727", "inbound_nodes": [[["conv2d_711", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_706", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_706", "inbound_nodes": [[["batch_normalization_722", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_708", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_708", "inbound_nodes": [[["batch_normalization_724", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_711", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_711", "inbound_nodes": [[["batch_normalization_727", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "block35_2_mixed", "trainable": true, "dtype": "float32", "axis": 3}, "name": "block35_2_mixed", "inbound_nodes": [[["activation_706", 0, 0, {}], ["activation_708", 0, 0, {}], ["activation_711", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "block35_2_conv", "trainable": true, "dtype": "float32", "filters": 320, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block35_2_conv", "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "block35_2", "trainable": true, "dtype": "float32", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AGQBGQB8AGQCGQB8ARQAFwBTACkDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpkL2hvbWUvZmlsZnkvYW5hY29uZGEzL2Vu\ndnMvb3dnL2xpYi9weXRob24zLjcvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlvbnMvaW5j\nZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6oAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "module": "keras_applications.inception_resnet_v2", "output_shape": [13, 13, 320], "output_shape_type": "raw", "output_shape_module": null, "arguments": {"scale": 0.17}}, "name": "block35_2", "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "block35_2_ac", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "block35_2_ac", "inbound_nodes": [[["block35_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_715", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_715", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_731", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_731", "inbound_nodes": [[["conv2d_715", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_715", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_715", "inbound_nodes": [[["batch_normalization_731", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_713", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_713", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_716", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_716", "inbound_nodes": [[["activation_715", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_729", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_729", "inbound_nodes": [[["conv2d_713", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_732", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_732", "inbound_nodes": [[["conv2d_716", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_713", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_713", "inbound_nodes": [[["batch_normalization_729", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_716", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_716", "inbound_nodes": [[["batch_normalization_732", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_712", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_712", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_714", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_714", "inbound_nodes": [[["activation_713", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_717", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_717", "inbound_nodes": [[["activation_716", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_728", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_728", "inbound_nodes": [[["conv2d_712", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_730", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_730", "inbound_nodes": [[["conv2d_714", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_733", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_733", "inbound_nodes": [[["conv2d_717", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_712", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_712", "inbound_nodes": [[["batch_normalization_728", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_714", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "activation_714", "inbound_nodes": [[["batch_normalization_730", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_717", 